Tekla Open API Reference for Tekla Structures 2025
Component Constructor
Overload List
Name | Description
Component()
 Creates a new component instance.
Component(ComponentInput)
 Creates a new component instance with the given component input.
Top
See Also
Reference
Component Class
Tekla.Structures.Model Namespace